cf_billing/Catalogs/энргСтроения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>энргСтроения</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Архив</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Бойлер</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидБлагоустройства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыБлагоустройств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОбъектаАбонентов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыОбъектовАбонента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГодПостройки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Город</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаПотребителейПоУмолчанию</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргГруппыПотребителей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дом</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Индекс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Корпус</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаселенныйПункт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Регион</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СлужебныеЗаписки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПлиты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргТипыПлит</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Улица</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЭтажей</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаршрутКонтроллера</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргМаршрутыКонтроллеров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСтроения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргТипыСтроений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>удалитьФилиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргФилиалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗакрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УлицаНедобавленнаяВФИАС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргУлицыНедобавленныеВФИАС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьВетхостьСтроения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаТочекПоставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргГруппыТочекПоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОКТМО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВидыБлагоустройстваТарифныеКатегории</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидБлагоустройстваИндивидуальный</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыБлагоустройств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидБлагоустройстваОбщедомовой</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыБлагоустройств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТарифнаяКатегория</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргГруппыПотребителей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf_billing/InformationRegisters/энргТехническаяВозможностьОРП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргТехническаяВозможностьОРП</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЕстьВозможность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Строение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПомещения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/бестРабочиеПостановленияМКД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестРабочиеПостановленияМКД</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Постановление</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бестРабочиеПостановления</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргИдентификаторыМКДГИСЖКХ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргИдентификаторыМКДГИСЖКХ</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИдентификаторДомаФИАС</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОКТМО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УникальныйНомерДома</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргФилиалыСтроений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргФилиалыСтроений</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Филиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргФилиалы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Строение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/Enums/бестРабочиеПостановления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бестРабочиеПостановления</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Постановление354</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Постановление77</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf_billing/Catalogs/энргСтроения/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОписаниеПеременных

&НаКлиенте
Перем ПодтвержденоЗакрытиеФормы;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	энргЛокализацияСервер.ПриСозданииНаСервере_энргСтроения(ЭтотОбъект);
	энргРаботаСПрикрепленнымиФайламиСервер.ПриСозданииНаСервере(ЭтотОбъект);
	
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.КонтактнаяИнформация") Тогда
		МодульУправлениеКонтактнойИнформацией = ОбщегоНазначения.ОбщийМодуль("УправлениеКонтактнойИнформацией");
		МодульУправлениеКонтактнойИнформацией.ПриСозданииНаСервере(ЭтотОбъект, Объект, "ГруппаКонтактнаяИнформация","Лево");
	КонецЕсли; 
		
	Если НЕ Параметры.Ключ.Пустая() Тогда
		ЗаполнитьУК(Объект.Ссылка);
	КонецЕсли;
	
	УстановитьОтборГИС();
	ЗаполнитьСвойстваДанными();
	УстановитьПризнакОРП();
	УстановитьОтборыДинамическихСписков();

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимостьЭлементов();
	ПодтвержденоЗакрытиеФормы = Ложь;
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.КонтактнаяИнформация") Тогда
		МодульУправлениеКонтактнойИнформацией = ОбщегоНазначения.ОбщийМодуль("УправлениеКонтактнойИнформацией");
		МодульУправлениеКонтактнойИнформацией.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	НастроитьНадписьПостановление();
	ПрочитатьФилиалСтроения();
	
	Если объект.ТипСтроения<>Перечисления.энргТипыСтроений.МКД тогда
		элементы.Маршрут.Видимость=Ложь; 
	КонецЕсли;
	
	ЗаполнитьДанныеВетхостиСтроения();
	
	Если ЗначениеЗаполнено(ТекущийОбъект.Наименование) и ТекущийОбъект.ТипСтроения=Перечисления.энргТипыСтроений.МКД тогда
		 Элементы.МаршрутКонтроллера.Видимость=Ложь;
		Результат=ЗАполнитьМаршрут(Объект.Ссылка);
		Выборка=Результат.Выбрать();
		Выборка.Следующий();
		Объект.МаршрутКонтроллера=выборка.МАршрут;
	иначе 
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.КонтактнаяИнформация") Тогда
		МодульУправлениеКонтактнойИнформацией = ОбщегоНазначения.ОбщийМодуль("УправлениеКонтактнойИнформацией");
		МодульУправлениеКонтактнойИнформацией.ОбработкаПроверкиЗаполненияНаСервере(ЭтотОбъект, Объект, Отказ);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	энргРаботаСПрикрепленнымиФайламиКлиент.ПередЗаписью(Отказ, ЭтотОбъект);
	
	Если Не ПараметрыЗаписи.Свойство("ВопросЗадан") И Модифицированность Тогда
		
		СтруктураАдресов = АдресаПомещенийИАбонентов(Объект.Ссылка);
		МассивПомещений = СтруктураАдресов.Помещения;
		МассивАбонентов = СтруктураАдресов.Абоненты; 
		КоличествоПомещений = МассивПомещений.Количество();
		КоличествоАбонентов = МассивАбонентов.Количество();
		Если КоличествоПомещений > 0 И КоличествоАбонентов > 0 Тогда
			ТекстВопроса = НСтр("ru = 'Изменить адреса помещений и абонентов, относящихся к этому строению?'");
		ИначеЕсли КоличествоПомещений > 0 Тогда
			ТекстВопроса = НСтр("ru = 'Изменить адреса помещений, относящихся к этому строению?'");
		ИначеЕсли КоличествоАбонентов > 0 Тогда
			ТекстВопроса = НСтр("ru = 'Изменить адреса абонентов, относящихся к этому строению?'");
		Иначе
			Возврат;
		КонецЕсли;
		Отказ = Истина;
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("МассивПомещений",			МассивПомещений);
		ДополнительныеПараметры.Вставить("МассивАбонентов",			МассивАбонентов);
		ДополнительныеПараметры.Вставить("СоответствиеАбонентов",	СтруктураАдресов.СоответствиеАбонентов);
		ДополнительныеПараметры.Вставить("ОтборПомещений",			Новый Структура("Тип, Вид", ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Адрес"), ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.АдресПомещения")));
		ДополнительныеПараметры.Вставить("ОтборАбонентов",			Новый Структура("Тип, Вид", ПредопределенноеЗначение("Перечисление.ТипыКонтактнойИнформации.Адрес"), ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.АдресОбъекта")));
		ДополнительныеПараметры.Вставить("ПараметрыЗаписи", 		ПараметрыЗаписи);
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ИзменитьАдресаПомещений", ЭтаФорма, ДополнительныеПараметры);
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
		
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.КонтактнаяИнформация") Тогда
		МодульУправлениеКонтактнойИнформацией = ОбщегоНазначения.ОбщийМодуль("УправлениеКонтактнойИнформацией");
		МодульУправлениеКонтактнойИнформацией.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	
	//СтрокиКИ 							= Объект.КонтактнаяИнформация.НайтиСтроки(Новый Структура("Вид",Справочники.ВидыКонтактнойИнформации.АдресДома));
	//Если СтрокиКИ.количество() > 0 тогда
	//	ТекущийОбъект.наименование  	= СтрокиКИ[0].Представление; 
	//КонецЕсли;
	ТекущийОбъект.ЗаполнитьНаименованиеСтроения();
	
	ОбновитьИнтерфейс 					= ТекущийОбъект.ЭтоНовый();		
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	//Если Не Отказ Тогда 
	ФИАС(ТекущийОбъект);
	//КонецЕсли;
	
	РС = РегистрыСведений.энргТехническаяВозможностьОРП;
	РС.УстановитьВозможностьОРП(Объект.Ссылка, Неопределено, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	энргРаботаСПрикрепленнымиФайламиКлиент.ПослеЗаписи(ЭтотОбъект);
	
	Если ОбновитьИнтерфейс Тогда
		ОбновитьИнтерфейс();
	КонецЕсли;
	
	УстановитьОтборГИС();
	УстановитьОтборыДинамическихСписков();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура УлицаНедобавленнаяВФИАСПриИзменении(Элемент)
	УлицаНедобавленнаяВФИАСПриИзмененииНаСервере();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВнестиИдентификаторДомаФИАС(Команда)
	Если Модифицированность Или Объект.Ссылка.Пустая() Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ОбработкаОтветаНаСохранение", ЭтотОбъект), "Данные изменены. Записать изменения?", РежимДиалогаВопрос.ДаНет);
	Иначе
		ЗапросФИАС();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	ПараметрыЗаписи = Новый Структура();
	ПараметрыЗаписи.Вставить("Закрыть", Истина);
	
	Если Записать(ПараметрыЗаписи) Тогда
		Закрыть();
	КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьВетхостьСтроения(Команда)
	Если Параметры.Ключ.Пустая() Тогда
		ПоказатьПредупреждение(,"Для добавления информации о ветхости необходимо записать элемент");
		Возврат;
	КонецЕсли;
	ОписаниеОповещения 		= новый ОписаниеОповещения("РегистрацияАварийностиСтроенияЗавершение", ЭтотОбъект);
	ПараметрыДляЗаполнения 	= новый Структура("ЗаполнитьДокумент, ДанныеДляЗаполнения", Истина,Новый Структура("Дата, Организация, Район, МКД", ТекущаяДата(), Объект.Организация, Объект.Район, Объект.Ссылка));
	ОткрытьФорму("Документ.энргРегистрацияАварийностиСтроения.Форма.ФормаДокумента", ПараметрыДляЗаполнения, Команда,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура КомандаИзменитьПостановление(Команда)
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ЗакрытиеФормыПостановление", ЭтаФорма);
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ЗначенияЗаполнения = Новый Структура("МКД, Район, Организация", Объект.Ссылка, Объект.Район, Объект.Организация);
		ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения);
		ОткрытьФорму("Документ.бестСменаРабочегоПостановленияМКД.ФормаОбъекта", ПараметрыФормы,ЭтаФорма,,,,ОповещениеОЗакрытии);
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура КомандаИсторияПостановления(Команда)
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		УсловияОтбора = Новый Структура("МКД", Объект.Ссылка);
		ПараметрыФормы = Новый Структура("Отбор", УсловияОтбора);
		ОткрытьФорму("РегистрСведений.бестРабочиеПостановленияМКД.ФормаСписка", ПараметрыФормы, ЭтаФорма);
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанные(Команда)
	ЗаполнитьСвойстваДанными();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьВидимостьЭлементов()
	
	Если объект.ТипСтроения = ПредопределенноеЗначение("Перечисление.энргТипыСтроений.МКД") тогда
		Элементы.ОКТМО.Видимость 										= Истина;
		Элементы.КоличествоНежилыхПомещений.Видимость 					= Истина;
		Элементы.КоличествоКвартир.Видимость 							= Истина;
		Элементы.ГрЗначенияПлощадей.Видимость 							= Истина;
		Элементы.Начисления.Видимость 									= Истина;
	ИначеЕсли объект.ТипСтроения = ПредопределенноеЗначение("Перечисление.энргТипыСтроений.ОБЩ") тогда
		Элементы.ФормаУправления.Видимость 								= Ложь;
		Элементы.РасчетОбъемовВыполняетУК.Видимость 					= Ложь;
		Элементы.УК.Видимость											= Ложь;
		элементы.Маршрут.Видимость 										= Ложь;
		элементы.ГруппаВидыБлагоустройстваТарифныеКатегории.Видимость 	= Ложь;
		Элементы.Начисления.Видимость 									= Истина;
	Иначе 
		Элементы.ФормаУправления.Видимость 								= Ложь;
		Элементы.РасчетОбъемовВыполняетУК.Видимость 					= Ложь;
		Элементы.УК.Видимость											= Ложь;
		элементы.Маршрут.Видимость 										= Ложь;
		элементы.ГруппаВидыБлагоустройстваТарифныеКатегории.Видимость 	= Ложь;
		Элементы.Начисления.Видимость 									= Ложь;	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборГИС()
	
	Перем ЭлементОтбора;
	
	ПолеКомпоновкиДанных = Новый ПолеКомпоновкиДанных("МКД");
	Отбор = Неопределено;
	Для каждого ТекОтбор Из ИдентификаторыГИСЖКХ.Отбор.Элементы Цикл
	    Если ПолеКомпоновкиДанных = ТекОтбор.ЛевоеЗначение Тогда
			Отбор = ТекОтбор;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если Отбор = Неопределено Тогда
		ЭлементОтбора = ИдентификаторыГИСЖКХ.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение	= Новый ПолеКомпоновкиДанных("МКД");
	Иначе
		ЭлементОтбора = Отбор;
	КонецЕсли;
	
	ЭлементОтбора.Использование 	= Истина;
	ЭлементОтбора.ПравоеЗначение 	= ?(ЗначениеЗаполнено(Объект.Ссылка), Объект.Ссылка, Неопределено);
	ЭлементОтбора.РежимОтображения 	= РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;

КонецПроцедуры

Процедура УстановитьОтборыДинамическихСписков()
	
	СсылкаМКД = ?(Параметры.Ключ.Пустая(), Неопределено, Объект.Ссылка);	
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(НачисленияМКД,						"МКД", 						СсылкаМКД);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ОтрицательныйОбъемРаспределенияМКД,	"МКД",						СсылкаМКД);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ОтрицательныйОбъемРаспределенияМКД,	"ОбъемУслугиПотребленный", 	0);	
	
	РаспределениеОДН.Параметры.УстановитьЗначениеПараметра("Организация"	, Объект.Организация);
	РаспределениеОДН.Параметры.УстановитьЗначениеПараметра("Район"		, Объект.Район);
	РаспределениеОДН.Параметры.УстановитьЗначениеПараметра("МКД"			, СсылкаМКД);
	
	РаспределениеСверхнормативногоОДН.Параметры.УстановитьЗначениеПараметра("Организация"	, Объект.Организация);
	РаспределениеСверхнормативногоОДН.Параметры.УстановитьЗначениеПараметра("Район"		, Объект.Район);
	РаспределениеСверхнормативногоОДН.Параметры.УстановитьЗначениеПараметра("МКД"			, СсылкаМКД);
КонецПроцедуры

&НаСервере
Процедура УлицаНедобавленнаяВФИАСПриИзмененииНаСервере()
	Если ЗначениеЗаполнено(Объект.УлицаНедобавленнаяВФИАС) Тогда
		СтрокиКИ 							= Объект.УлицаНедобавленнаяВФИАС.КонтактнаяИнформация.НайтиСтроки(Новый Структура("Вид",Справочники.ВидыКонтактнойИнформации.АдресНедобавленногоОбъекта));
		Если СтрокиКИ.количество() > 0 тогда
			Объект.КонтактнаяИнформация.Очистить();
			ОбъектТек = РеквизитФормыВЗначение("Объект");
			НовСтр = ОбъектТек.КонтактнаяИнформация.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр, СтрокиКИ[0]);
			НовСтр.Вид =   Справочники.ВидыКонтактнойИнформации.АдресДома;
			//УправлениеКонтактнойИнформацией.ДобавитьКонтактнуюИнформацию(ОбъектТек, СтрокиКИ[0].Представление, Справочники.ВидыКонтактнойИнформации.АдресДома); 
			//УправлениеКонтактнойИнформацией.ДобавитьКонтактнуюИнформацию(ОбъектТек, СтрокиКИ[0].Представление, Справочники.ВидыКонтактнойИнформации.СтроительныйАдресДома);
			УправлениеКонтактнойИнформацией.ПриЧтенииНаСервере(ЭтаФорма, ОбъектТек);
			ЗначениеВРеквизитФормы(ОбъектТек,"Объект");

			
			//УправлениеКонтактнойИнформацией.ЗаписатьКонтактнуюИнформацию(Объект, СтрокиКИ[0].Значение,Справочники.ВидыКонтактнойИнформации.АдресДома,Перечисления.ТипыКонтактнойИнформации.Адрес);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РегистрацияАварийностиСтроенияЗавершение(Результат, ДопПарамеры) Экспорт
	ЗаполнитьДанныеВетхостиСтроения();	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьАдресаПомещений(РезультатВопроса, ДополнительныеПараметры) Экспорт 
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ОписаниеКИ = УправлениеКонтактнойИнформациейКлиентСервер.ОписаниеКонтактнойИнформацииНаФорме(ЭтотОбъект);
		СтрокиКИ = ОписаниеКИ.НайтиСтроки(Новый Структура("Вид", ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.АдресДома")));
		Если СтрокиКИ.Количество() > 0 тогда
			ИзменитьАдресаПомещенийНаСервере(ДополнительныеПараметры.МассивПомещений, СтрокиКИ[0].Значение, ДополнительныеПараметры.ОтборПомещений);
			ИзменитьАдресаПомещенийНаСервере(ДополнительныеПараметры.МассивАбонентов, СтрокиКИ[0].Значение, ДополнительныеПараметры.ОтборАбонентов, ДополнительныеПараметры.СоответствиеАбонентов);
		КонецЕсли;
	КонецЕсли;
	
	ДополнительныеПараметры.ПараметрыЗаписи.Вставить("ВопросЗадан", Истина);
	Если Записать(ДополнительныеПараметры.ПараметрыЗаписи) И ДополнительныеПараметры.ПараметрыЗаписи.Свойство("Закрыть") Тогда
		Закрыть();
	КонецЕсли;
	
	//ПодтвержденоЗакрытиеФормы = Истина;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ИзменитьАдресаПомещенийНаСервере(МассивПомещений, АдресСтроения, Отбор, Соответствие = Неопределено)
	
	СтруктураJSONСтроения	= УправлениеКонтактнойИнформациейСлужебный.JSONВКонтактнуюИнформациюПоПолям(АдресСтроения, Перечисления.ТипыКонтактнойИнформации.Адрес);
	
	Для Каждого Помещение Из МассивПомещений Цикл
		
		ПомещениеОбъект = Помещение.ПолучитьОбъект();
		
		СтрокиАдреса = ПомещениеОбъект.КонтактнаяИнформация.НайтиСтроки(Отбор); 
		НадоЗаписать = Ложь;
		Для Каждого ТекСтрока Из СтрокиАдреса Цикл
			
			СтруктураJSONПомещения		= УправлениеКонтактнойИнформациейСлужебный.JSONВКонтактнуюИнформациюПоПолям(ТекСтрока.Значение, Перечисления.ТипыКонтактнойИнформации.Адрес);
			СтруктураJSONПомещенияНовая	= ОбщегоНазначения.СкопироватьРекурсивно(СтруктураJSONСтроения);
			
			СтруктураJSONПомещенияНовая.Вставить("apartments", СтруктураJSONПомещения.apartments);
			
			РаботаСАдресамиКлиентСервер.ОбновитьПредставлениеАдреса(СтруктураJSONПомещенияНовая, Ложь);
			ТекСтрока.Значение 		= УправлениеКонтактнойИнформациейСлужебный.СтруктураВСтрокуJSON(СтруктураJSONПомещенияНовая);
			ТекСтрока.Представление	= СтруктураJSONПомещенияНовая.Value;
			
			НадоЗаписать = Истина;
		КонецЦикла;
		
		Если Не НадоЗаписать И ЗначениеЗаполнено(Соответствие) Тогда
			АдресПомещения = Соответствие.Получить(Помещение);
			Если ЗначениеЗаполнено(АдресПомещения) Тогда
				ЗначениеАдреса = АдресПомещения;
			Иначе
				ЗначениеАдреса = АдресСтроения;
			КонецЕсли;
			УправлениеКонтактнойИнформацией.ЗаписатьКонтактнуюИнформацию(ПомещениеОбъект, ЗначениеАдреса, Справочники.ВидыКонтактнойИнформации.АдресОбъекта, Перечисления.ТипыКонтактнойИнформации.Адрес);
			
			НадоЗаписать = Истина;
		КонецЕсли;
		
		Если НадоЗаписать Тогда				
			ПомещениеОбъект.ДополнительныеСвойства.Вставить("НеПроверятьНаличиеФайла", Истина);
			ПомещениеОбъект.ДополнительныеСвойства.Вставить("НеВыполнятьКонтрольУдаляемых", Истина);
			ПомещениеОбъект.ОбменДанными.Загрузка	= Истина;
			ПомещениеОбъект.Записать();
		КонецЕсли;
	КонецЦикла;	  
КонецПроцедуры

&НаСервереБезКонтекста
Функция АдресаПомещенийИАбонентов(Строение)

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	энргПомещения.Ссылка КАК Помещение
	               |ИЗ
	               |	Справочник.энргКлючиПомещений КАК энргКлючиПомещений
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргПомещения КАК энргПомещения
	               |		ПО энргКлючиПомещений.Помещение = энргПомещения.Ссылка
	               |			И (энргКлючиПомещений.Строение = &Строение)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	энргАбоненты.Ссылка КАК Абонент,
	               |	энргПомещенияКонтактнаяИнформация.Значение КАК АдресПомещения
	               |ИЗ
	               |	Справочник.энргАбоненты КАК энргАбоненты
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргКлючиПомещений КАК энргКлючиПомещений
	               |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргПомещения.КонтактнаяИнформация КАК энргПомещенияКонтактнаяИнформация
	               |			ПО энргКлючиПомещений.Помещение = энргПомещенияКонтактнаяИнформация.Ссылка
	               |				И (энргПомещенияКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)
	               |					И энргПомещенияКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресПомещения))
	               |		ПО энргАбоненты.КлючПомещения = энргКлючиПомещений.Ссылка
	               |			И (энргКлючиПомещений.Строение = &Строение)";
	Запрос.УстановитьПараметр("Строение", Строение);
	
	Пакет = Запрос.ВыполнитьПакет();
	МассивПомещений = Пакет.Получить(0).Выгрузить().ВыгрузитьКолонку("Помещение");
	
	ВыборкаАбонентов = Пакет.Получить(1).Выбрать();
	МассивАбонентов = Новый Массив;
	СоответствиеАбонентов = Новый Соответствие;
	Пока ВыборкаАбонентов.Следующий() Цикл
		МассивАбонентов.Добавить(ВыборкаАбонентов.Абонент);
		СоответствиеАбонентов.Вставить(ВыборкаАбонентов.Абонент, ВыборкаАбонентов.АдресПомещения);
	КонецЦикла;
	
	СтруктураАдресов = Новый Структура("Помещения, Абоненты, СоответствиеАбонентов", МассивПомещений, МассивАбонентов, СоответствиеАбонентов);
	Возврат СтруктураАдресов;

КонецФункции

&НаСервере 
Функция ЗаполнитьМаршрут(ТекОбъект)
		                             	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	энргМаршрутыКонтроллеровАдресаМаршрута.Представление КАК Представление,
	|	энргМаршрутыКонтроллеров.Ссылка КАК Маршрут,
	|	энргМаршрутыКонтроллеров.Владелец КАК Контроллер
	|ПОМЕСТИТЬ ВТ_Маршруты
	|ИЗ
	|	Справочник.энргМаршрутыКонтроллеров КАК энргМаршрутыКонтроллеров
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргМаршрутыКонтроллеров.АдресаМаршрута КАК энргМаршрутыКонтроллеровАдресаМаршрута
	|		ПО энргМаршрутыКонтроллеров.Ссылка = энргМаршрутыКонтроллеровАдресаМаршрута.Ссылка
	|			И (НЕ энргМаршрутыКонтроллеров.ПометкаУдаления)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_Маршруты.Маршрут КАК Маршрут,
	|	ВТ_Маршруты.Контроллер КАК Контроллер
	|ИЗ
	|	(ВЫБРАТЬ
	|		энргСтроения.Ссылка КАК МКД,
	|		энргСтроенияКонтактнаяИнформация.Представление КАК Представление
	|	ИЗ
	|		Справочник.энргСтроения КАК энргСтроения
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргСтроения.КонтактнаяИнформация КАК энргСтроенияКонтактнаяИнформация
	|			ПО энргСтроения.Ссылка = энргСтроенияКонтактнаяИнформация.Ссылка
	|				И (энргСтроения.Ссылка = &МКД)) КАК АдресМКД
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Маршруты КАК ВТ_Маршруты
	|		ПО (АдресМКД.Представление ПОДОБНО ВТ_Маршруты.Представление + ""%"")";
	
	Запрос.УстановитьПараметр("МКД",ТекОбъект.ссылка); 	
	
	Результат = Запрос.Выполнить();
	Возврат Результат;		
КонецФункции

&НаСервере
Процедура УстановитьПризнакОРП()
	
	РезультатЗапроса = РегистрыСведений.энргТехническаяВозможностьОРП.ПолучитьВозможностьОРП(Объект.Ссылка);
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда 
		ТехническаяВозможностьПроведенияОРП = Выборка.ЕстьВозможность;
	Иначе
		ТехническаяВозможностьПроведенияОРП = Ложь;
	КонецЕсли;
КонецПроцедуры

// СтандартныеПодсистемы.КонтактнаяИнформация
&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияПриИзменении(Элемент)
	УправлениеКонтактнойИнформациейКлиент.НачатьИзменение(ЭтотОбъект, Элемент);
КонецПроцедуры
	
&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	УправлениеКонтактнойИнформациейКлиент.НачатьВыбор(ЭтотОбъект, Элемент, , СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияПриНажатии(Элемент, СтандартнаяОбработка)
    УправлениеКонтактнойИнформациейКлиент.НачатьВыбор(ЭтотОбъект, Элемент, , СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияОчистка(Элемент, СтандартнаяОбработка)
    УправлениеКонтактнойИнформациейКлиент.НачатьОчистку(ЭтотОбъект, Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияВыполнитьКоманду(Команда)
    УправлениеКонтактнойИнформациейКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
    УправлениеКонтактнойИнформациейКлиент.АвтоПодборАдреса(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
    УправлениеКонтактнойИнформациейКлиент.ОбработкаВыбора(ЭтотОбъект, ВыбранноеЗначение, Элемент.Имя, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
    УправлениеКонтактнойИнформациейКлиент.НачатьОбработкуНавигационнойСсылки(ЭтотОбъект, Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьОбновлениеКонтактнойИнформации(Результат, ДополнительныеПараметры) Экспорт
    ОбновитьКонтактнуюИнформацию(Результат);
КонецПроцедуры

&НаСервере
Процедура ОбновитьКонтактнуюИнформацию(Результат)
	
	УправлениеКонтактнойИнформацией.ОбновитьКонтактнуюИнформацию(ЭтотОбъект, Объект, Результат);

	ОбъектСервер = РеквизитФормыВЗначение("Объект");
	ОбъектСервер.ЗаполнитьНаименованиеСтроения();
	ЗначениеВРеквизитФормы(ОбъектСервер, "Объект");
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.КонтактнаяИнформация

&НаСервере
Процедура ЗаполнитьУК(ТекОбъект)
	СтруктураДанных 	= Новый Структура("ФормаУправления, УК, РасчетОбъемовВыполняетУК");
	энргРаботаСЛицевымСчетомСервер.ПолучитьДанныеУК_МКД(ТекОбъект, ТекущаяДата(), СтруктураДанных);
	ФормаУправления				= СтруктураДанных.ФормаУправления;
	УК							= СтруктураДанных.УК;
	РасчетОбъемовВыполняетУК	= СтруктураДанных.РасчетОбъемовВыполняетУК;
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда)
	
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.Печать") Тогда
		МодульУправлениеПечатьюКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("УправлениеПечатьюКлиент");
		МодульУправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтаФорма, Объект);
	КонецЕсли;
	
КонецПроцедуры

Процедура НастроитьНадписьПостановление()
	пПостановление = РегистрыСведений.бестРабочиеПостановленияМКД.ПолучитьПоследнее(ТекущаяДата(), Новый Структура("МКД", Объект.Ссылка)).Постановление;
	пПостановление = ?(ЗначениеЗаполнено(пПостановление), пПостановление, Перечисления.бестРабочиеПостановления.Постановление354);
	Постановление = ?(ЗначениеЗаполнено(пПостановление), пПостановление, "<< >>");
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытиеФормыПостановление(Результат,ДополнительныеПараметры) Экспорт 
    НастроитьНадписьПостановление();
КонецПроцедуры

&НаСервере
Процедура ПослеВводаСтроки(Строка, Параметры) Экспорт
	
	Если Не ЗначениеЗаполнено(Строка) Тогда 
	//	Или Строка = "00000000-0000-0000-0000-000000000000" Тогда 
		Возврат;
	КонецЕсли;
	
	СпрОбъект = РеквизитФормыВЗначение("Объект");
	НаборЗаписей = РегистрыСведений.энргИдентификаторыМКДГИСЖКХ.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.МКД.Установить(Объект.Ссылка);
	НаборЗаписей.Прочитать();
	Если НаборЗаписей.Количество() > 0 Тогда
		Запись = НаборЗаписей[0];
	Иначе
		Запись = НаборЗаписей.Добавить();
		Запись.МКД = Объект.Ссылка;
	КонецЕсли;
	Запись.ИдентификаторДомаФИАС = Строка;
	Запись.ОКТМО = СпрОбъект.ПолучитьДанныеИзАдреса("oktmo");
	НаборЗаписей.Записать();
	ЭтаФорма.Прочитать();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОтветаНаСохранение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Попытка
			Успех = Записать();
		Исключение
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр(ОписаниеОшибки()));
			Успех = Ложь;
		КонецПопытки;
		Если Не Успех Тогда 
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru='Не удалось записать'"));
		Иначе
			ЗапросФИАС();
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗапросФИАС()
	
	Перем Оповещение, СтрокаФИАС;
	
	Оповещение	= Новый ОписаниеОповещения("ПослеВводаСтроки", ЭтаФорма);
	
	СтрокаФИАС	= ПолучитьДанныеИзАдреса("houseId");	
	Если Не ЗначениеЗаполнено(СтрокаФИАС) Тогда
		СтрокаФИАС = "00000000-0000-0000-0000-000000000000";
		
	КонецЕсли;
	
	ПоказатьВводСтроки(Оповещение, СтрокаФИАС, "Введите Идентификатор дома по ФИАС или Идентификационный код дома в ГИС ЖКХ", 36, Ложь);
КонецПроцедуры

&НаСервере
Процедура ПрочитатьФилиалСтроения()
	
	Филиал = РегистрыСведений.энргФилиалыСтроений.ПолучитьПоследнее(,Новый Структура("Строение",Объект.Ссылка)).Филиал;
	
КонецПроцедуры

&Насервере
Процедура ФИАС(ТекущийОбъект) 
	Перем Оповещение, СтрокаФИАС;
	
	//Оповещение = Новый ОписаниеОповещения("ПослеВводаСтроки", ЭтаФорма);
	//СпрОбъект = РеквизитФормыВЗначение("Объект");
	СтрокаФИАС = ТекущийОбъект.ПолучитьДанныеИзАдреса("houseId");		
	//ПоказатьВводСтроки(Оповещение, СтрокаФИАС, "Введите Идентификатор дома по ФИАС или Идентификационный код дома в ГИС ЖКХ", 36, Ложь);
	
	НаборЗаписей = РегистрыСведений.энргИдентификаторыМКДГИСЖКХ.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.МКД.Установить(Объект.Ссылка);
	НаборЗаписей.Прочитать();
	Если НаборЗаписей.Количество() > 0 Тогда
		Запись = НаборЗаписей[0];
	Иначе
		Запись = НаборЗаписей.Добавить();
		Запись.МКД = Объект.Ссылка;
	КонецЕсли;
	Если СтрокаФИАС ="" тогда
		Возврат
	ИначеЕсли Не ЗначениеЗаполнено(Запись.ИдентификаторДомаФИАС) Тогда	
		Запись.ИдентификаторДомаФИАС = СтрокаФИАС;
	КонецЕсли;
	
	Запись.ОКТМО = ТекущийОбъект.ПолучитьДанныеИзАдреса("oktmo");
	НаборЗаписей.Записать();
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеИзАдреса(ИмяСв)
	 СпрОбъект = РеквизитФормыВЗначение("Объект");
	 Возврат	СпрОбъект.ПолучитьДанныеИзАдреса(ИмяСв);
КонецФункции

#Область Заполнение_Данных

&НаСервере
Процедура ЗаполнитьСвойстваДанными()
	ОчиститьОбновляемыеДанные();
	
	ЭтоМКД = объект.ТипСтроения = Перечисления.энргТипыСтроений.МКД;	

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВложенныйЗапрос.Помещение КАК Помещение,
		|	ВложенныйЗапрос.КлючПомещения КАК КлючПомещения,
		|	ВложенныйЗапрос.Абонент КАК Абонент,
		|	ВложенныйЗапрос.ТипПомещения КАК ТипПомещения
		|ПОМЕСТИТЬ ВТ_Помещения
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВложенныйЗапрос.Строение КАК МКД,
		|		ВложенныйЗапрос.Помещение КАК Помещение,
		|		ВложенныйЗапрос.Ссылка КАК КлючПомещения,
		|		энргАбоненты.Ссылка КАК Абонент,
		|		ВложенныйЗапрос.ТипПомещения КАК ТипПомещения
		|	ИЗ
		|		(ВЫБРАТЬ
		|			энргКлючиПомещений.КлючПомещения КАК Ссылка,
		|			энргКлючиПомещений.Строение КАК Строение,
		|			энргКлючиПомещений.Помещение КАК Помещение,
		|			энргПомещения.ТипПомещения КАК ТипПомещения
		|		ИЗ
		|			РегистрСведений.энргКлючиПомещений КАК энргКлючиПомещений
		|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргПомещения КАК энргПомещения
		|				ПО энргКлючиПомещений.Помещение = энргПомещения.Ссылка
		|					И (НЕ энргПомещения.ПометкаУдаления)
		|					И энргКлючиПомещений.Строение = энргПомещения.Строение
		|		ГДЕ
		|			энргКлючиПомещений.Строение = &Строение
		|			И НЕ энргКлючиПомещений.Помещение = ЗНАЧЕНИЕ(Справочник.энргПомещения.ПустаяСсылка)
		|		
		|		СГРУППИРОВАТЬ ПО
		|			энргКлючиПомещений.КлючПомещения,
		|			энргКлючиПомещений.Строение,
		|			энргКлючиПомещений.Помещение,
		|			энргПомещения.ТипПомещения) КАК ВложенныйЗапрос
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргАбоненты КАК энргАбоненты
		|			ПО ВложенныйЗапрос.Ссылка = энргАбоненты.КлючПомещения
		|				И (НЕ энргАбоненты.ПометкаУдаления)
		|				И (НЕ энргАбоненты.ЭтоГруппа)
		|	
		|	СГРУППИРОВАТЬ ПО
		|		энргАбоненты.Ссылка,
		|		ВложенныйЗапрос.Помещение,
		|		ВложенныйЗапрос.Ссылка,
		|		ВложенныйЗапрос.Строение,
		|		ВложенныйЗапрос.ТипПомещения) КАК ВложенныйЗапрос
		|
		|СГРУППИРОВАТЬ ПО
		|	ВложенныйЗапрос.КлючПомещения,
		|	ВложенныйЗапрос.Помещение,
		|	ВложенныйЗапрос.Абонент,
		|	ВложенныйЗапрос.ТипПомещения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Помещения.Помещение КАК Помещение,
		|	ВТ_Помещения.КлючПомещения КАК КлючПомещения,
		|	ВТ_Помещения.Абонент КАК Абонент,
		|	ВТ_Помещения.ТипПомещения КАК ТипПомещения
		|ПОМЕСТИТЬ ВТ_АбонентыПомещений
		|ИЗ
		|	ВТ_Помещения КАК ВТ_Помещения
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.энргСостояниеЛС.СрезПоследних(
		|				&Период,
		|				Организация = &Организация
		|					И Район = &Район
		|					И Абонент В
		|						(ВЫБРАТЬ
		|							ВТ_Помещения.Абонент КАК Абонент
		|						ИЗ
		|							ВТ_Помещения КАК ВТ_Помещения)) КАК энргСостояниеЛССрезПоследних
		|		ПО ВТ_Помещения.Абонент = энргСостояниеЛССрезПоследних.Абонент
		|			И (энргСостояниеЛССрезПоследних.Состояние)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	энргЗначенияПлощадейСрезПоследних.КлючПомещения КАК КлючПомещения,
		|	энргЗначенияПлощадейСрезПоследних.Площадь КАК Площадь
		|ПОМЕСТИТЬ ВТ_Площали
		|ИЗ
		|	РегистрСведений.энргЗначенияПлощадей.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И Район = &Район
		|				И ВидПлощади = ЗНАЧЕНИЕ(Перечисление.энргВидыПлощадей.ОбщаяПлощадь)
		|				И КлючПомещения В
		|					(ВЫБРАТЬ
		|						ВТ_АбонентыПомещений.КлючПомещения КАК КлючПомещения
		|					ИЗ
		|						ВТ_АбонентыПомещений КАК ВТ_АбонентыПомещений)) КАК энргЗначенияПлощадейСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	бестАктивностьТочекУчетаНПСрезПоследних.Организация КАК Организация,
		|	бестАктивностьТочекУчетаНПСрезПоследних.Район КАК Район,
		|	бестАктивностьТочекУчетаНПСрезПоследних.ОбъектРасчета КАК ОбъектРасчета
		|ПОМЕСТИТЬ АктивныеОбъектыРасчетов
		|ИЗ
		|	РегистрСведений.бестАктивностьТочекУчетаНП.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И Район = &Район
		|				И ОбъектРасчета.МКД = &Строение) КАК бестАктивностьТочекУчетаНПСрезПоследних
		|ГДЕ
		|	бестАктивностьТочекУчетаНПСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.энргСостояниеТочекУчета.Включена)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	бестЗначенияПлощадейНПСрезПоследних.ОбъектРасчета КАК ОбъектРасчета,
		|	бестЗначенияПлощадейНПСрезПоследних.Площадь КАК Площадь
		|ПОМЕСТИТЬ ЗначенияПлощадейНП
		|ИЗ
		|	РегистрСведений.бестЗначенияПлощадейНП.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И Район = &Район
		|				И ВидПлощади = ЗНАЧЕНИЕ(Перечисление.энргВидыПлощадей.ОбщаяПлощадьНП)
		|				И ОбъектРасчета В
		|					(ВЫБРАТЬ
		|						АктивныеОбъектыРасчетов.ОбъектРасчета КАК ОбъектРасчета
		|					ИЗ
		|						АктивныеОбъектыРасчетов КАК АктивныеОбъектыРасчетов)) КАК бестЗначенияПлощадейНПСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	бестДоговорыТочекУчетаСрезПоследних.ОбъектРасчета КАК ОбъектРасчета,
		|	МАКСИМУМ(бестДоговорыТочекУчетаСрезПоследних.Договор) КАК Договор
		|ПОМЕСТИТЬ ДоговорОбъектаРасчета
		|ИЗ
		|	РегистрСведений.бестДоговорыТочекУчета.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И Район = &Район
		|				И ОбъектРасчета В
		|					(ВЫБРАТЬ
		|						АктивныеОбъектыРасчетов.ОбъектРасчета КАК ОбъектРасчета
		|					ИЗ
		|						АктивныеОбъектыРасчетов КАК АктивныеОбъектыРасчетов)) КАК бестДоговорыТочекУчетаСрезПоследних
		|
		|СГРУППИРОВАТЬ ПО
		|	бестДоговорыТочекУчетаСрезПоследних.ОбъектРасчета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_АбонентыПомещений.Помещение КАК Помещение,
		|	ВТ_АбонентыПомещений.КлючПомещения КАК КлючПомещения,
		|	ВТ_АбонентыПомещений.Абонент КАК Абонент,
		|	ЕСТЬNULL(ВТ_Площали.Площадь, 0) КАК Площадь,
		|	ВТ_АбонентыПомещений.ТипПомещения КАК ТипПомещения
		|ИЗ
		|	ВТ_АбонентыПомещений КАК ВТ_АбонентыПомещений
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Площали КАК ВТ_Площали
		|		ПО ВТ_АбонентыПомещений.КлючПомещения = ВТ_Площали.КлючПомещения
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	АктивныеОбъектыРасчетов.ОбъектРасчета,
		|	ЗНАЧЕНИЕ(Справочник.энргКлючиПомещений.ПустаяСсылка),
		|	ДоговорОбъектаРасчета.Договор.Контрагент,
		|	ЕСТЬNULL(ЗначенияПлощадейНП.Площадь, 0),
		|	ЗНАЧЕНИЕ(Перечисление.энргТипыПомещений.НежилоеПомещение)
		|ИЗ
		|	АктивныеОбъектыРасчетов КАК АктивныеОбъектыРасчетов
		|		ЛЕВОЕ СОЕДИНЕНИЕ ЗначенияПлощадейНП КАК ЗначенияПлощадейНП
		|		ПО АктивныеОбъектыРасчетов.ОбъектРасчета = ЗначенияПлощадейНП.ОбъектРасчета
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДоговорОбъектаРасчета КАК ДоговорОбъектаРасчета
		|		ПО АктивныеОбъектыРасчетов.ОбъектРасчета = ДоговорОбъектаРасчета.ОбъектРасчета
		|
		|УПОРЯДОЧИТЬ ПО
		|	ТипПомещения,
		|	Помещение";
	
	
	Запрос.УстановитьПараметр("Период"		, ТекущаяДата());
	Запрос.УстановитьПараметр("Организация"	, Объект.Организация);
	Запрос.УстановитьПараметр("Район"		, Объект.Район);
	Запрос.УстановитьПараметр("Строение"	, ?(Параметры.Ключ.Пустая(), Неопределено, Объект.Ссылка));
	
	РезультатЗапроса 	= Запрос.Выполнить(); 	
	Выборка 			= РезультатЗапроса.Выбрать();
	ТипКвартира			= Перечисления.энргТипыПомещений.Квартира;
	ТипНежилое			= Перечисления.энргТипыПомещений.НежилоеПомещение;
	Пока Выборка.Следующий() Цикл
		Если ЭтоМКД Тогда
			Если Выборка.ТипПомещения = ТипКвартира Тогда
				КоличествоКвартир 			= КоличествоКвартир 			+ 1;
				ПлощадьЖилыхПомещений 		= ПлощадьЖилыхПомещений 		+ Выборка.Площадь;
			ИначеЕсли Выборка.ТипПомещения = ТипНежилое Тогда 
				КоличествоНежилыхПомещений 	= КоличествоНежилыхПомещений 	+ 1;			
				ПлощадьНежилыхПомещений 	= ПлощадьНежилыхПомещений 		+ Выборка.Площадь;
			КонецЕсли;			
		КонецЕсли;
		
		НоваяСтрока = Помещения.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,Выборка);		
	КонецЦикла;
	
	Если ЭтоМКД Тогда 
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргЗначениеПлощадейМКДСрезПоследних.ВидПлощади КАК ВидПлощади,
		|	энргЗначениеПлощадейМКДСрезПоследних.Площадь КАК Площадь
		|ИЗ
		|	РегистрСведений.энргЗначениеПлощадейМКД.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И Район = &Район
		|				И МКД = &Строение
		|				И ВидПлощади В (ЗНАЧЕНИЕ(Перечисление.энргВидыПлощадей.ОбщаяПлощадьМКД), ЗНАЧЕНИЕ(Перечисление.энргВидыПлощадей.ПлощадьМОП))) КАК энргЗначениеПлощадейМКДСрезПоследних";
		
		Запрос.УстановитьПараметр("Период"		, ТекущаяДата());
		Запрос.УстановитьПараметр("Организация"	, Объект.Организация);
		Запрос.УстановитьПараметр("Район"		, Объект.Район);
		Запрос.УстановитьПараметр("Строение"	, ?(Параметры.Ключ.Пустая(), Неопределено, Объект.Ссылка));
		
		РезультатЗапроса 	= Запрос.Выполнить();		
		Выборка 			= РезультатЗапроса.Выбрать();
		ВидПлощадьОбщая			= Перечисления.энргВидыПлощадей.ОбщаяПлощадьМКД;
		ВидПлощадьМОП			= Перечисления.энргВидыПлощадей.ПлощадьМОП;
		Пока Выборка.Следующий() Цикл
			Если Выборка.ВидПлощади = ВидПлощадьМОП Тогда
				ПлощадьМОП 		= Выборка.Площадь;
			КонецЕсли;
			Если Выборка.ВидПлощади = ВидПлощадьОбщая Тогда
				ОбщаяПлощадь 	= Выборка.Площадь;
			КонецЕсли; 			
		КонецЦикла;
		
	КонецЕсли; 
 
КонецПроцедуры

Процедура ОчиститьОбновляемыеДанные()
	Помещения.Очистить();
	КоличествоКвартир 			= 0;
	КоличествоНежилыхПомещений 	= 0;
	ПлощадьЖилыхПомещений 		= 0;			
	ПлощадьНежилыхПомещений 	= 0;
	ОбщаяПлощадь 				= 0;			
	ПлощадьМОП 					= 0;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеВетхостиСтроения()
	
	ПроцентВетхости = Справочники.энргСтроения.ПолучитьПроцентВетхостиСтроения(ТекущаяДата(), Объект.Организация, Объект.Район, Объект.Ссылка);
	
	ПроцентБольшеНуля					= ПроцентВетхости > 0;
	ВетхостьСтроения 					= ПроцентБольшеНуля;
	Элементы.ПроцентВетхости.Видимость 	= ПроцентБольшеНуля;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
